# wczytanie pliku
read_verilog sumator.v

#spłaszczanie wykresu - wczytywanie modułów pobocznych
synth -flatten

#synteza wysokiego poziomu
proc; opt; fsm; opt; memory; opt


techmap; opt

# biblioteki gate level
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib

# ładniejszy zapis portów wejściowych
splitnets -ports; opt

write_verilog cmos_gl_adder.v
show
