Qflow static timing analysis logfile created on piÄ…, 19 cze 2020, 01:43:45 CEST
Creating example SDC file for timing
Creating OpenSTA input file adder.conf
Running OpenSTA static timing analysis
sta  < adder.conf
OpenSTA 2.0.17 GITDIR-NOT Copyright (c) 2019, Parallax Software, Inc.
License GPLv3: GNU GPL version 3 <http://gnu.org/licenses/gpl.html>

This is free software, and you are free to change and redistribute it
under certain conditions; type `show_copying' for details. 
This program comes with ABSOLUTELY NO WARRANTY; for details type `show_warranty'.
OpenSTA> read_liberty -min /usr/local/share/qflow/tech/osu018/osu018_stdcells.lib
OpenSTA> read_liberty -max /usr/local/share/qflow/tech/osu018/osu018_stdcells.lib
Warning: /usr/local/share/qflow/tech/osu018/osu018_stdcells.lib, line 8 library osu018_stdcells already exists.
OpenSTA> read_verilog adder.rtlnopwr.v
OpenSTA> link_design adder
Warning: adder.rtlnopwr.v, line 84 module FILL not found.  Creating black box for FILL5880x2050.
OpenSTA> read_sdc adder.sdc
Warning: adder.sdc, 1 port 'clock' not found.
OpenSTA> check_setup
Warning: There are 12 input ports missing set_input_delay.
Warning: There are 7 output ports missing set_output_delay.
Warning: There are 7 unconstrained endpoints.
OpenSTA> report_annotated_check
                                                          Not   
Check type                        Total    Annotated   Annotated
----------------------------------------------------------------
----------------------------------------------------------------
                                      0           0           0
OpenSTA> report_annotated_delay
                                                          Not   
Delay type                        Total    Annotated   Annotated
----------------------------------------------------------------
cell arcs                           102           0         102
internal net arcs                    78           0          78
net arcs from primary inputs         24           0          24
net arcs to primary outputs           7           0           7
----------------------------------------------------------------
                                    211           0         211
OpenSTA> report_checks -path_delay min_max -group_count 1000
No paths found.
OpenSTA> exit
Saving command history
